[IO_BalanceDef_TinaBomb InteractiveObjectBalanceDefinition]
DefaultDisplayName="Honorable member Tina Chiquita"

[IO_TinaBomb InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[M_Anemone_MyBrittlePony MissionDefinition]
MissionName="good wine"
MissionDescription="Somewhere in the ruins of Helios was just a donkey. Happy City finds her and asks to check on her health. Don't worry, you will always get help from the best editors.."
TurnInDescription="You are now in good hands. More like."
MissionSummary="Del Vaughan's team."
MissionGiver="Success"
MissionTurnInLocation="Vaughn"
TeaserText="It's time to save Diamond, the cutest pony!!"

[M_Anemone_MyBrittlePony:CheckOnTina MissionObjectiveDefinition]
ProgressMessage="Go to Tina"

[M_Anemone_MyBrittlePony:FindButtstallion MissionObjectiveDefinition]
ProgressMessage="Find the last ring"

[M_Anemone_MyBrittlePony:KeepSearching MissionObjectiveDefinition]
ProgressMessage="to know"

[M_Anemone_MyBrittlePony:MeetTheTeam MissionObjectiveDefinition]
ProgressMessage="Meet the team!"

[M_Anemone_MyBrittlePony:MeetTina MissionObjectiveDefinition]
ProgressMessage="I met Tiina"

[M_Anemone_MyBrittlePony:ProtectTina MissionObjectiveDefinition]
ProgressMessage="Save Tina and the dog from the donkey"

[M_Anemone_MyBrittlePony:ReachHelios MissionObjectiveDefinition]
ProgressMessage="Go to Helios"

[M_Anemone_MyBrittlePony:SearchHelios MissionObjectiveDefinition]
ProgressMessage="Find Helios with battery"

[M_Anemone_MyBrittlePony:Set_CheckOntina MissionObjectiveSetDefinition]
MissionSummaryOverride="Good luck Tina!."
MissionDescriptionOverride="Vaughan tells you to find the donkey next to Helios, but Tina beats you to it. Meet Tina and it will be easy for both of us.."

[M_Anemone_MyBrittlePony:Set_KeepSearching MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_MyBrittlePony:Set_MeetTheTeam MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_MyBrittlePony:Set_MeetTina MissionObjectiveSetDefinition]
MissionSummaryOverride="Meet Tina and Ace Stud."
MissionDescriptionOverride=""

[M_Anemone_MyBrittlePony:Set_ProtectTina MissionObjectiveSetDefinition]
MissionSummaryOverride="Take care of my mother."
MissionDescriptionOverride="Bone tells you to find the donkey instead of Helios, but Tina meets him. Stud Ace is locked behind the door, but he and Tina are better. And surprisingly, you didn't hit us when you broke the door, although Tina was quick to defend herself. Of course he's alive.."

[M_Anemone_MyBrittlePony:Set_ReachHelios MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Among the remains of Helios is only a donkey. Vaughn wants you to find him and make sure he's safe. does not increase [place]Helios fell[-place] Then we meet Brick."

[M_Anemone_MyBrittlePony:Set_SearchHelios MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="The calf stood alone in the wilderness of Elijah. Get him and make sure he's safe, Vaughan said. Now that you've reached Helias and finished the brick, clear the area and look for the Diamond Pony token. "

[M_Anemone_MyBrittlePony:Set_Shootbomb MissionObjectiveSetDefinition]
MissionSummaryOverride="He led the horse out of the herd."
MissionDescriptionOverride="Van says you should get the plate around Helios, but Tina says you should do it. The deer is behind a closed door, but he and Tina look tired. Get the dynamite and close the door.."

[M_Anemone_MyBrittlePony:Set_TalkToTina MissionObjectiveSetDefinition]
MissionSummaryOverride="go to tina."
MissionDescriptionOverride="Bones lets you board the Helios, but Tina follows you outside. But luckily, he and Tina appear to be safe. Mom woke up the donkey after cleaning the house! Well, maybe I'll meet my mom.."

[M_Anemone_MyBrittlePony:ShootBomb MissionObjectiveDefinition]
ProgressMessage="Shoot the bomb"

[M_Anemone_MyBrittlePony:TalkToTina MissionObjectiveDefinition]
ProgressMessage="Talk to Tina."

